{
  "format": "layers-model",
  "generatedBy": "keras 3.x",
  "convertedBy": "manual",
  "modelTopology": {
    "module": "keras.src.models.functional",
    "class_name": "Model",
    "config": {
      "name": "specialist_densenet121",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "specialist_densenet121_input"
          },
          "registered_name": null,
          "name": "specialist_densenet121_input",
          "inbound_nodes": []
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "zero_padding2d",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                3,
                3
              ],
              [
                3,
                3
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              224,
              224,
              3
            ]
          },
          "name": "zero_padding2d",
          "inbound_nodes": [
            [
              [
                "specialist_densenet121_input",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              7,
              7
            ],
            "strides": [
              2,
              2
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              230,
              230,
              3
            ]
          },
          "name": "conv1_conv",
          "inbound_nodes": [
            [
              [
                "zero_padding2d",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              112,
              112,
              64
            ]
          },
          "name": "conv1_bn",
          "inbound_nodes": [
            [
              [
                "conv1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv1_relu",
          "inbound_nodes": [
            [
              [
                "conv1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "zero_padding2d_1",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              112,
              112,
              64
            ]
          },
          "name": "zero_padding2d_1",
          "inbound_nodes": [
            [
              [
                "conv1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "pool1",
            "trainable": false,
            "dtype": "float32",
            "pool_size": [
              3,
              3
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "name": "pool1",
          "inbound_nodes": [
            [
              [
                "zero_padding2d_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block1_0_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_0_bn",
          "inbound_nodes": [
            [
              [
                "pool1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block1_0_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block1_0_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block1_0_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block1_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_1_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block1_0_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block1_1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block1_1_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block1_1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block1_1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block1_1_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block1_1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block1_2_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block1_2_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block1_1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Concatenate",
          "config": {
            "name": "conv2_block1_concat",
            "trainable": false,
            "dtype": "float32",
            "axis": 3
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              [
                null,
                56,
                56,
                64
              ],
              [
                null,
                56,
                56,
                32
              ]
            ]
          },
          "name": "conv2_block1_concat",
          "inbound_nodes": [
            {
              "args": [
                [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "pool1",
                        0,
                        0
                      ]
                    }
                  },
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        32
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block1_2_conv",
                        0,
                        0
                      ]
                    }
                  }
                ]
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block2_0_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              96
            ]
          },
          "name": "conv2_block2_0_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block1_concat",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block2_0_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block2_0_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block2_0_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block2_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              96
            ]
          },
          "name": "conv2_block2_1_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block2_0_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block2_1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block2_1_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block2_1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block2_1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block2_1_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block2_1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block2_2_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block2_2_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block2_1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Concatenate",
          "config": {
            "name": "conv2_block2_concat",
            "trainable": false,
            "dtype": "float32",
            "axis": 3
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              [
                null,
                56,
                56,
                96
              ],
              [
                null,
                56,
                56,
                32
              ]
            ]
          },
          "name": "conv2_block2_concat",
          "inbound_nodes": [
            {
              "args": [
                [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        96
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block1_concat",
                        0,
                        0
                      ]
                    }
                  },
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        32
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block2_2_conv",
                        0,
                        0
                      ]
                    }
                  }
                ]
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block3_0_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block3_0_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block2_concat",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block3_0_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block3_0_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block3_0_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block3_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block3_1_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block3_0_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block3_1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block3_1_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block3_1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block3_1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block3_1_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block3_1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block3_2_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block3_2_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block3_1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Concatenate",
          "config": {
            "name": "conv2_block3_concat",
            "trainable": false,
            "dtype": "float32",
            "axis": 3
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              [
                null,
                56,
                56,
                128
              ],
              [
                null,
                56,
                56,
                32
              ]
            ]
          },
          "name": "conv2_block3_concat",
          "inbound_nodes": [
            {
              "args": [
                [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block2_concat",
                        0,
                        0
                      ]
                    }
                  },
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        32
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block3_2_conv",
                        0,
                        0
                      ]
                    }
                  }
                ]
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block4_0_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              160
            ]
          },
          "name": "conv2_block4_0_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block3_concat",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block4_0_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block4_0_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block4_0_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block4_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              160
            ]
          },
          "name": "conv2_block4_1_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block4_0_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block4_1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block4_1_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block4_1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block4_1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block4_1_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block4_1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block4_2_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              128
            ]
          },
          "name": "conv2_block4_2_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block4_1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Concatenate",
          "config": {
            "name": "conv2_block4_concat",
            "trainable": false,
            "dtype": "float32",
            "axis": 3
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              [
                null,
                56,
                56,
                160
              ],
              [
                null,
                56,
                56,
                32
              ]
            ]
          },
          "name": "conv2_block4_concat",
          "inbound_nodes": [
            {
              "args": [
                [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        160
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block3_concat",
                        0,
                        0
                      ]
                    }
                  },
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        32
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block4_2_conv",
                        0,
                        0
                      ]
                    }
                  }
                ]
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block5_0_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              192
            ]
          },
          "name": "conv2_block5_0_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block4_concat",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block5_0_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block5_0_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block5_0_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block5_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 128,
