{
  "format": "layers-model",
  "generatedBy": "keras 3.x",
  "convertedBy": "manual",
  "modelTopology": {
    "module": "keras.src.models.functional",
    "class_name": "Model",
    "config": {
      "name": "scout_mobilenet_nails",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "scout_mobilenet_nails_input"
          },
          "registered_name": null,
          "name": "scout_mobilenet_nails_input",
          "inbound_nodes": []
        },
        {
          "module": "keras.layers",
          "class_name": "Rescaling",
          "config": {
            "name": "rescaling",
            "trainable": false,
            "dtype": "float32",
            "scale": 0.00784313725490196,
            "offset": -1
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              224,
              224,
              3
            ]
          },
          "name": "rescaling",
          "inbound_nodes": [
            [
              [
                "scout_mobilenet_nails_input",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 16,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              224,
              224,
              3
            ]
          },
          "name": "conv",
          "inbound_nodes": [
            [
              [
                "rescaling",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              112,
              112,
              16
            ]
          },
          "name": "conv_bn",
          "inbound_nodes": [
            [
              [
                "conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu",
          "inbound_nodes": [
            [
              [
                "conv_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "expanded_conv_depthwise_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                0,
                1
              ],
              [
                0,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              112,
              112,
              16
            ]
          },
          "name": "expanded_conv_depthwise_pad",
          "inbound_nodes": [
            [
              [
                "re_lu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "DepthwiseConv2D",
          "config": {
            "name": "expanded_conv_depthwise",
            "trainable": false,
            "dtype": "float32",
            "depth_multiplier": 1,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": false,
            "depthwise_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "depthwise_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "depthwise_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              113,
              113,
              16
            ]
          },
          "name": "expanded_conv_depthwise",
          "inbound_nodes": [
            [
              [
                "expanded_conv_depthwise_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_depthwise_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              16
            ]
          },
          "name": "expanded_conv_depthwise_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_depthwise",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu_1",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu_1",
          "inbound_nodes": [
            [
              [
                "expanded_conv_depthwise_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "expanded_conv_project",
            "trainable": false,
            "dtype": "float32",
            "filters": 16,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              16
            ]
          },
          "name": "expanded_conv_project",
          "inbound_nodes": [
            [
              [
                "re_lu_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_project_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              16
            ]
          },
          "name": "expanded_conv_project_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_project",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "expanded_conv_1_expand",
            "trainable": false,
            "dtype": "float32",
            "filters": 72,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              16
            ]
          },
          "name": "expanded_conv_1_expand",
          "inbound_nodes": [
            [
              [
                "expanded_conv_project_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_1_expand_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              72
            ]
          },
          "name": "expanded_conv_1_expand_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_expand",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu_2",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu_2",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_expand_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "expanded_conv_1_depthwise_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                0,
                1
              ],
              [
                0,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              72
            ]
          },
          "name": "expanded_conv_1_depthwise_pad",
          "inbound_nodes": [
            [
              [
                "re_lu_2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "DepthwiseConv2D",
          "config": {
            "name": "expanded_conv_1_depthwise",
            "trainable": false,
            "dtype": "float32",
            "depth_multiplier": 1,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": false,
            "depthwise_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "depthwise_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "depthwise_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              57,
              57,
              72
            ]
          },
          "name": "expanded_conv_1_depthwise",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_depthwise_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_1_depthwise_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              72
            ]
          },
          "name": "expanded_conv_1_depthwise_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_depthwise",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu_3",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu_3",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_depthwise_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "expanded_conv_1_project",
            "trainable": false,
            "dtype": "float32",
            "filters": 24,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              72
            ]
          },
          "name": "expanded_conv_1_project",
          "inbound_nodes": [
            [
              [
                "re_lu_3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_1_project_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              24
            ]
          },
          "name": "expanded_conv_1_project_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_project",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "expanded_conv_2_expand",
            "trainable": false,
            "dtype": "float32",
            "filters": 88,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              24
            ]
          },
          "name": "expanded_conv_2_expand",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_project_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_2_expand_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              88
            ]
          },
          "name": "expanded_conv_2_expand_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_2_expand",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu_4",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu_4",
          "inbound_nodes": [
            [
              [
                "expanded_conv_2_expand_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "DepthwiseConv2D",
          "config": {
            "name": "expanded_conv_2_depthwise",
            "trainable": false,
            "dtype": "float32",
            "depth_multiplier": 1,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": false,
            "depthwise_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "depthwise_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "depthwise_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              88
            ]
          },
          "name": "expanded_conv_2_depthwise",
          "inbound_nodes": [
            [
              [
                "re_lu_4",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_2_depthwise_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              88
            ]
          },
          "name": "expanded_conv_2_depthwise_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_2_depthwise",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu_5",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu_5",
          "inbound_nodes": [
            [
              [
                "expanded_conv_2_depthwise_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "expanded_conv_2_project",
            "trainable": false,
            "dtype": "float32",
            "filters": 24,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              88
            ]
          },
          "name": "expanded_conv_2_project",
          "inbound_nodes": [
            [
              [
                "re_lu_5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_2_project_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              24
            ]
          },
          "name": "expanded_conv_2_project_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_2_project",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Add",
          "config": {
            "name": "expanded_conv_2_add",
            "trainable": false,
            "dtype": "float32"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              [
                null,
                28,
                28,
                24
              ],
              [
                null,
                28,
                28,
                24
              ]
            ]
          },
          "name": "expanded_conv_2_add",
          "inbound_nodes": [
            [
              [
                "expanded_conv_1_project_bn",
                0,
                0,
                {}
              ],
              [
                "expanded_conv_2_project_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "expanded_conv_3_expand",
            "trainable": false,
            "dtype": "float32",
            "filters": 96,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              24
            ]
          },
          "name": "expanded_conv_3_expand",
          "inbound_nodes": [
            [
              [
                "expanded_conv_2_add",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_3_expand_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              96
            ]
          },
          "name": "expanded_conv_3_expand_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_3_expand",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu_6",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu_6",
          "inbound_nodes": [
            [
              [
                "expanded_conv_3_expand_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "expanded_conv_3_depthwise_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                0,
                1
              ],
              [
                0,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              96
            ]
          },
          "name": "expanded_conv_3_depthwise_pad",
          "inbound_nodes": [
            [
              [
                "re_lu_6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "DepthwiseConv2D",
          "config": {
            "name": "expanded_conv_3_depthwise",
            "trainable": false,
            "dtype": "float32",
            "depth_multiplier": 1,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": false,
            "depthwise_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "depthwise_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "depthwise_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              29,
              29,
              96
            ]
          },
          "name": "expanded_conv_3_depthwise",
          "inbound_nodes": [
            [
              [
                "expanded_conv_3_depthwise_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "expanded_conv_3_depthwise_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.999,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              14,
              14,
              96
            ]
          },
          "name": "expanded_conv_3_depthwise_bn",
          "inbound_nodes": [
            [
              [
                "expanded_conv_3_depthwise",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ReLU",
          "config": {
            "name": "re_lu_7",
            "trainable": false,
            "dtype": "float32",
            "max_value": null,
            "negative_slope": 0,
            "threshold": 0
          },
          "registered_name": null,
          "name": "re_lu_7",
          "inbound_nodes": [
            [
              [
                "expanded_conv_3_depthwise_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "expanded_conv_3_project",
            "trainable": false,
            "dtype": "float32",
            "filters": 40,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
