{
  "format": "layers-model",
  "generatedBy": "keras 3.x",
  "convertedBy": "manual",
  "modelTopology": {
    "module": "keras.src.models.functional",
    "class_name": "Model",
    "config": {
      "name": "specialist_resnet50v2",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "specialist_resnet50v2_input"
          },
          "registered_name": null,
          "name": "specialist_resnet50v2_input",
          "inbound_nodes": []
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "conv1_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                3,
                3
              ],
              [
                3,
                3
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              224,
              224,
              3
            ]
          },
          "name": "conv1_pad",
          "inbound_nodes": [
            [
              [
                "specialist_resnet50v2_input",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              7,
              7
            ],
            "strides": [
              2,
              2
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              230,
              230,
              3
            ]
          },
          "name": "conv1_conv",
          "inbound_nodes": [
            [
              [
                "conv1_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "pool1_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              112,
              112,
              64
            ]
          },
          "name": "pool1_pad",
          "inbound_nodes": [
            [
              [
                "conv1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "pool1_pool",
            "trainable": false,
            "dtype": "float32",
            "pool_size": [
              3,
              3
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "name": "pool1_pool",
          "inbound_nodes": [
            [
              [
                "pool1_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block1_preact_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_preact_bn",
          "inbound_nodes": [
            [
              [
                "pool1_pool",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block1_preact_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block1_preact_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block1_preact_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block1_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_1_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block1_preact_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block1_1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_1_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block1_1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block1_1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block1_1_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block1_1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "conv2_block1_2_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_2_pad",
          "inbound_nodes": [
            [
              [
                "conv2_block1_1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block1_2_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              58,
              58,
              64
            ]
          },
          "name": "conv2_block1_2_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block1_2_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block1_2_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_2_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block1_2_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block1_2_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block1_2_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block1_2_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block1_0_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_0_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block1_preact_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block1_3_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block1_3_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block1_2_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Add",
          "config": {
            "name": "conv2_block1_out",
            "trainable": false,
            "dtype": "float32"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              [
                null,
                56,
                56,
                256
              ],
              [
                null,
                56,
                56,
                256
              ]
            ]
          },
          "name": "conv2_block1_out",
          "inbound_nodes": [
            {
              "args": [
                [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        256
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block1_0_conv",
                        0,
                        0
                      ]
                    }
                  },
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        256
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block1_3_conv",
                        0,
                        0
                      ]
                    }
                  }
                ]
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block2_preact_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              256
            ]
          },
          "name": "conv2_block2_preact_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block1_out",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block2_preact_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block2_preact_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block2_preact_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block2_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              256
            ]
          },
          "name": "conv2_block2_1_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block2_preact_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block2_1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block2_1_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block2_1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block2_1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block2_1_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block2_1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "conv2_block2_2_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block2_2_pad",
          "inbound_nodes": [
            [
              [
                "conv2_block2_1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block2_2_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              58,
              58,
              64
            ]
          },
          "name": "conv2_block2_2_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block2_2_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block2_2_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block2_2_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block2_2_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block2_2_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block2_2_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block2_2_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block2_3_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block2_3_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block2_2_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Add",
          "config": {
            "name": "conv2_block2_out",
            "trainable": false,
            "dtype": "float32"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              [
                null,
                56,
                56,
                256
              ],
              [
                null,
                56,
                56,
                256
              ]
            ]
          },
          "name": "conv2_block2_out",
          "inbound_nodes": [
            {
              "args": [
                [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        256
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block1_out",
                        0,
                        0
                      ]
                    }
                  },
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        56,
                        56,
                        256
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv2_block2_3_conv",
                        0,
                        0
                      ]
                    }
                  }
                ]
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block3_preact_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              256
            ]
          },
          "name": "conv2_block3_preact_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block2_out",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block3_preact_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block3_preact_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block3_preact_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block3_1_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              256
            ]
          },
          "name": "conv2_block3_1_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block3_preact_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block3_1_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block3_1_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block3_1_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block3_1_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block3_1_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block3_1_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "ZeroPadding2D",
          "config": {
            "name": "conv2_block3_2_pad",
            "trainable": false,
            "dtype": "float32",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              56,
              56,
              64
            ]
          },
          "name": "conv2_block3_2_pad",
          "inbound_nodes": [
            [
              [
                "conv2_block3_1_relu",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block3_2_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              58,
              58,
              64
            ]
          },
          "name": "conv2_block3_2_conv",
          "inbound_nodes": [
            [
              [
                "conv2_block3_2_pad",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "conv2_block3_2_bn",
            "trainable": false,
            "dtype": "float32",
            "axis": 3,
            "momentum": 0.99,
            "epsilon": 0.00001001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              64
            ]
          },
          "name": "conv2_block3_2_bn",
          "inbound_nodes": [
            [
              [
                "conv2_block3_2_conv",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Activation",
          "config": {
            "name": "conv2_block3_2_relu",
            "trainable": false,
            "dtype": "float32",
            "activation": "relu"
          },
          "registered_name": null,
          "name": "conv2_block3_2_relu",
          "inbound_nodes": [
            [
              [
                "conv2_block3_2_bn",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": false,
            "dtype": "float32",
            "pool_size": [
              1,
              1
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "name": "max_pooling2d",
          "inbound_nodes": [
            [
              [
                "conv2_block2_out",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2_block3_3_conv",
            "trainable": false,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
